public class Main {
    public static void main(String[] args) {
        WholeProcess w = new WholeProcess();
        w.start();
    }
}


/*
a)  В задании нельзя использовать циклы for и for each. Только while и Iterator                             ☑️

b)  Написать приложение которое бы считывало сначала 5 строк
    которые вводит юзер и сохраняла бы их в Список А.                                                       ☑️

c)  Затем программа должна отобразить этот список                                                           ☑️

d)  Потом программа считывает еще 5 строк, которые вводит юзер и помещает их в Список Б.
    После также отображает его в консоли                                                                    ☑️

e)  Объединить Список А со Списком Б в новый список С следующим образом {A1,B5,А2,Б4,А3,Б3,А4,Б2,А5,Б1}     ☑️

f)  После объединения отобразить в консоли список С                                                         ☑️

g)   В конце отсортировать элементы списка С по длине слова,
    сначала идут String-и с наименьшим количеством символов,
    и распечатать отсортированный список С.                                                                 ☑️

 */
